Revit 2026 API

# DuctSettingsAirDensity Property

---

The air density in kg/ft^3.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AirDensity { get; set; }
```
```vb
Public Property AirDensity As Double
	Get
	Set
```
```cpp
public:
property double AirDensity {
	double get ();
	void set (double value);
}
```
```fsharp
member AirDensity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for airDensity must be non-negative. |

#### Reference

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace